app/controllers/locations_controller.rb

SELECT * FROM `locations` WHERE (`locations`.`id` = 1) ORDER BY state
SELECT * FROM `offerings` WHERE (`offerings`.location_id = 7) ORDER BY registration_deadline,registration_begins
---
  def show
    @types = Type.all
    @topics = Topic.all
    @location = Location.includes(:region).find(params[:id])
    @offerings = Offering.includes(:plan, :topics, :type, :location, :coordinator).where("location_id = ?", @location.id).validated.paginate(:page => params[:page], :per_page => 10)

SELECT * FROM `locations` WHERE (`locations`.`id` = 1)
---
  def edit
    @region = Region.where("name = ?", params[:region_id].gsub("-", " ")).first
    @location = @region.locations.find(params[:id])

SELECT * FROM `regions`
---
    def load_regions
      @regions = Region.all