app/controllers/offerings_controller.rb

SELECT * FROM `offerings` WHERE (validated=1) ORDER BY registration_deadline,registration_begins
SELECT * FROM `locations` WHERE (`locations`.`id` = 33) ORDER BY state
SELECT * FROM `offerings` WHERE (`offerings`.`id` IN (5,4)) ORDER BY registration_deadline,registration_begins
---
  def index
    @types = Type.order("category").all
    @topics = Topic.order("category").all
    if(params[:coordinated] == "true")
      logger.debug"*****************************************"
      @offerings = current_user.coordinated_offerings.future_offerings.paginate(:page => params[:page], :per_page => 10)
    else
      @offerings = Offering.validated(:all, :include => [:location, :coordinator, :registered_artists, :plan, :users])
			if(!params[:type].nil?)
				@offerings.where("type_id=?", params[:type].to_i)

SELECT * FROM `locations` WHERE (`locations`.`id` = 30) ORDER BY state
SELECT * FROM `offerings` WHERE (`offerings`.`id` = 4) ORDER BY registration_deadline,registration_begins
SELECT * FROM `types` WHERE (`types`.`id` = 5) ORDER BY category
SELECT `regions`.* FROM `regions` INNER JOIN `locations` ON `regions`.id = `locations`.region_id WHERE ((`locations`.id = 24)) ORDER BY name
---
  def show
    @offering = Offering.find(params[:id], :include => [:location, :region, :plan, :registered_artists, :topics, :type ])

INSERT INTO `offerings` (`topic_id`, `start_date`, `registration_deadline`, `updated_at`, `title`, `specific_location`, `type_id`, `location_id`, `description`, `validated`, `link`, `registration_begins`, `created_at`) VALUES(NULL, '2011-02-12', NULL, '2011-02-12 07:51:32', 'Online Course With Adrienne', NULL, 4, 7, 'This is a description of what this event is.', 0, 'www.google.com', '2011-02-12', '2011-02-12 07:51:32')
---
  def create
    @offering = current_user.coordinated_offerings.create(params[:offering])

SELECT * FROM `offerings` WHERE (`offerings`.`id` = 5) ORDER BY registration_deadline,registration_begins
UPDATE `offerings` SET `region_id` = 2, `location_id` = 7, `plan_id` = 1, `registration_begins` = '2011-02-20', `updated_at` = '2011-02-18 21:44:12' WHERE `id` = 162
---
  def update
    @offering = Offering.find(params[:id])
    if(current_admin)
      @offering.validated = params[:offering][:validated]
      @offering.featured_date = params[:offering][:featured_date]
      @offering.note = params[:offering][:note]
    else
      @offering.update_attribute(:validated, false)

SELECT * FROM `offerings` WHERE (`offerings`.`id` = 4) ORDER BY registration_deadline,registration_begins
DELETE FROM `offerings` WHERE `id` = 2
---
  def destroy
    @offering = Offering.find(params[:id])
    @offering.destroy

SELECT * FROM `types` ORDER BY category
SELECT * FROM `topics` ORDER BY category
SELECT * FROM `locations` WHERE (`locations`.`id` = 7) ORDER BY state
SELECT `regions`.* FROM `regions` INNER JOIN `locations` ON `regions`.id = `locations`.region_id WHERE ((`locations`.id = 24)) ORDER BY name
SELECT * FROM `plans`
---
    def load_variables
      @artists = User.artists.order("last_name")
      @types = Type.all
      @topics = Topic.all
      @regions = Region.find(:all, :include => [:locations])
      @plans = Plan.all