app/controllers/offerings_controller.rb

  def create
    @offering = Offering.new(params[:offering])
    @offering.contact = @contact
    if (@offering.valid? & @contact.valid?)
      @contact.save!
---
INSERT INTO `contacts` (`name`, `updated_at`, `number`, `offering_id`, `email`, `created_at`) VALUES('Daniel Bercht', '2011-01-28 22:09:30', '', NULL, '', '2011-01-28 22:09:30')
UPDATE `contacts` SET `offering_id` = 4, `updated_at` = '2011-01-28 22:09:30' WHERE `id` = 1

  def edit
    @offering = Offering.find(params[:id])
---
SELECT * FROM `offerings` WHERE (`offerings`.`id` = 5) ORDER BY registration_deadline,registration_begins

  def update
    @offering = Offering.find(params[:id])
    if (@contact.update_attributes(params[:contact])  )
---
UPDATE `contacts` SET `number` = '9787931352', `email` = 'd.bercht@gmail.com', `updated_at` = '2011-01-28 22:18:49' WHERE `id` = 1

  def load_variables
    @regions = Region.find(:all)
    @topics = Topic.find(:all)
    @types = Type.find(:all)
    @locations = Location.all
    @plans = Plan.find(:all)
---
SELECT * FROM `topics` WHERE (`topics`.`id` IN (6,5,2)) ORDER BY category
SELECT * FROM `types` WHERE (`types`.`id` = 1) ORDER BY category
SELECT * FROM `locations` ORDER BY state
SELECT * FROM `plans` WHERE (`plans`.`id` = 2)