app/controllers/plans_controller.rb

SELECT * FROM `plans`
---
  def index
    @plans = Plan.all

SELECT * FROM `plans` WHERE (`plans`.`id` = 1)
---
  def show
    @plan = Plan.find(params[:id])

INSERT INTO `plans` (`name`, `updated_at`, `created_at`) VALUES('Basic', '2011-02-18 21:01:27', '2011-02-18 21:01:27')
---
  def create
    @plan = Plan.new(params[:plan])

    respond_to do |format|
      if @plan.save