app/controllers/searches_controller.rb

SELECT * FROM `offerings` WHERE (validated=1 and (title like '%%' or state like '%%')) ORDER BY registration_deadline, registration_begins
SELECT * FROM `offerings` LIMIT 1
---
  def create
    if (params[:offering][:type_ids] != nil)
      @offerings = Offering.find(:all, :conditions => ["type_id IN (?) and validated=? and title like ?", params[:offering][:type_ids], true, "%" + params[:offering][:title]+"%"])
    else
       @offerings = Offering.find(:all, :conditions => ["validated=? and title like ?", true, "%" + params[:offering][:title]+"%"])
     end
     if (params[:offering][:topic_ids] != nil)
      @topic_ids = params[:offering][:topic_ids].map{|i| i.to_i}