app/controllers/searches_controller.rb

  def index
    @search = Offering.new
    @topics = Topic.all
    @types = Type.all
---
SELECT * FROM `topics` ORDER BY category
SELECT * FROM `types` ORDER BY category

  def results
    #Cleaning out search request by removing verb tenses and any exclamation points, etc And spaces are substituted by the sql delimiter
    clean_query(params[:offering][:title])
    logger.info "#{params[:offering][:title]}**************************"
    if (params[:offering][:type_ids] != nil) #If type was chosen
      @offerings = Offering.find(:all, :conditions => ["type_id IN (?) and validated=? and (title like ?)", params[:offering][:type_ids], true, "%" + params[:offering][:title]+"%"], :order => 'registration_deadline, registration_begins')
---
SELECT * FROM `offerings` WHERE (type_id IN ('3') and validated=1 and (title like '%%' or state like '%%')) ORDER BY registration_deadline, registration_begins, registration_deadline,registration_begins