app/controllers/statics_controller.rb

SELECT * FROM `topics` ORDER BY category
SELECT * FROM `types` ORDER BY category
---
  def home
    @offering = Offering.new
    @topics = Topic.all
    @types = Type.all