app/controllers/topics_controller.rb

  def index
    @topics = Topic.all
---
SELECT * FROM `topics` ORDER BY category

  def show
    @types = Type.all
    @topics = Topic.all
    @topic = Topic.find(params[:id])
    @offerings = @topic.offerings.validated.includes(:plan, :topics, :type, :location, :coordinator, :region, :registered_artists).paginate(:page => params[:page], :per_page => 10)
---
SELECT * FROM `topics` WHERE (`topics`.`id` = 4) ORDER BY category
SELECT * FROM `locations` WHERE (`locations`.`id` = 12)
SELECT * FROM `offerings` INNER JOIN `offerings_topics` ON `offerings`.id = `offerings_topics`.offering_id WHERE (`offerings_topics`.topic_id = 4 ) ORDER BY registration_deadline,registration_begins
SELECT * FROM `types` WHERE (`types`.`id` = 2)

  def edit
    @topic = Topic.find(params[:id])
---
SELECT * FROM `topics` WHERE (`topics`.`id` = 7) ORDER BY category

  def create
    @topic = Topic.new(params[:topic])

    respond_to do |format|
      if @topic.save
---
INSERT INTO `topics` (`category`, `updated_at`, `offering_id`, `created_at`) VALUES('Drawing', '2011-01-28 21:56:35', NULL, '2011-01-28 21:56:35')