app/controllers/types_controller.rb

SELECT * FROM `types` ORDER BY category ASC, category
---
  def index
    @types = Type.all

SELECT * FROM `types` WHERE (`types`.`id` = 1) ORDER BY category
SELECT * FROM `locations` WHERE (`locations`.`id` = 7)
SELECT * FROM `offerings` WHERE (`offerings`.type_id = 1) ORDER BY registration_deadline,registration_begins
---
  def show
    @type = Type.find(params[:id])
    @offerings = @type.offerings.includes(:plan, :topics, :type, :location, :coordinator).validated

SELECT * FROM `types` WHERE (`types`.`id` = 1) ORDER BY category
---
  def edit
    @type = Type.find(params[:id])

INSERT INTO `types` (`category`, `updated_at`, `offering_id`, `created_at`) VALUES('E-Course', '2011-01-28 21:56:22', NULL, '2011-01-28 21:56:22')
---
  def create
    @type = Type.new(params[:type])

    respond_to do |format|
      if @type.save

SELECT * FROM `types` WHERE (`types`.`id` = 2)
DELETE FROM `types` WHERE `id` = 2
---
  def destroy
    @type = Type.find(params[:id])
    @type.destroy