app/controllers/users_controller.rb

INSERT INTO `users` (`updated_at`, `crypted_password`, `username`, `password_salt`, `admin`, `persistence_token`, `email`, `created_at`) VALUES('2011-02-25 21:13:51', '8ea3d8cc38ba6040d4c46d6c4b1c77a0f8af892fee3b511dd73b0d8183e09ba44c1352ebc7d0f1e814fc0c2b426151c42cec7a485c3ffbf724c1112cdabade2d', 'jetgreene', 'dnYPgYgtVHWulUV6WYj', NULL, 'ffe29ed12717d393c176cf4ab71cc932395ea5635213b4a6ab387d3a05306644db0a8778a706b4585cc8dcd2bf17ce24a6a100a3362b9932a811b2a7e6da9a6f', 'd.bercht@gmail.com', '2011-02-25 21:13:51')
---
  def create
    @user = User.new(params[:user])
    if @user.save